In [1]:
from pandas import Series,DataFrame
import numpy as np
import pandas as pd

In [4]:
df=DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

按行进行求和

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

按列进行求和

In [6]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

找到最大值或最小值的索引

In [7]:
df.idxmax()

one    b
two    d
dtype: object

In [9]:
df.idxmin()

one    d
two    b
dtype: object

In [10]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

一次性产生多个汇总统计

In [12]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

对于非值类型的统计信息

In [13]:
obj=Series(['a','a','b','c']*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [14]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### 2 相关系数与协方差

In [16]:
#import pandas.io.data as web
import pandas_datareader.data as web

In [ ]:
all_data={}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker]=web.get_data_yahoo(ticker,'1/1/2017','1/1/2017')
price=DataFrame({tic:data['Adj Close'] for tic,data in all_data.iteritems()})
volume=DataFrame({tic:data['Volume'] for itc,data in all_data.iteritems()})

In [ ]:
price

In [ ]:
returns=price.pct_change()
returns.tail()

### 3 唯一值、值计数以及成员资格

In [22]:
obj=Series(['c','a','b','a','a','b','c','c'])

In [23]:
uniques=obj.unique()

In [24]:
uniques

array(['c', 'a', 'b'], dtype=object)

In [26]:
# 计算各值出现的频率
obj.value_counts()

a    3
c    3
b    2
dtype: int64

In [28]:
pd.value_counts(obj.values,sort=False)

c    3
b    2
a    3
dtype: int64

判断Series各值是否包含于传入的值序列中 的布尔型数组

In [34]:
mask=obj.isin(['b','c'])
mask

0     True
1    False
2     True
3    False
4    False
5     True
6     True
7     True
dtype: bool

In [30]:
obj[mask]

0    c
2    b
5    b
6    c
7    c
dtype: object

In [31]:
data=DataFrame({'Qu1':[1,2,3,4,5],
               'Qu2':[2,3,4,5,6],
               'Qu3':[3,4,5,6,7]})
data

   Qu1  Qu2  Qu3
0    1    2    3
1    2    3    4
2    3    4    5
3    4    5    6
4    5    6    7

In [32]:
data.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  NaN  NaN
2  1.0  1.0  NaN
3  1.0  1.0  1.0
4  1.0  1.0  1.0
5  1.0  1.0  1.0
6  NaN  1.0  1.0
7  NaN  NaN  1.0

对于空值自动填充

In [33]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  0.0  0.0
2  1.0  1.0  0.0
3  1.0  1.0  1.0
4  1.0  1.0  1.0
5  1.0  1.0  1.0
6  0.0  1.0  1.0
7  0.0  0.0  1.0